nxp-mcuxpresso/mcux-soc-svd/MCXA356/MCXA356.xml
        <register>
          <name>FlexPWM0_SM1_EXTSYNC</name>
          <description>PWM0 input trigger connections</description>
          <addressOffset>0x3AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIGIN</name>
              <description>EXTSYNC input connections for PWM0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val1</name>
                  <description>ARM_TXEV input is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>AOI0_OUT0 input is selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>AOI0_OUT1 input is selected</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>AOI0_OUT2 input is selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>AOI0_OUT3 input is selected</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>CMP0_OUT input is selected</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>CMP1_OUT input is selected</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>CMP2_OUT input is selected</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>CTimer0_MAT2 input is selected</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>CTimer0_MAT3 input is selected</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>CTimer1_MAT2 input is selected</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>CTimer1_MAT3 input is selected</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>CTimer2_MAT2 input is selected</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>CTimer2_MAT3 input is selected</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val15</name>
                  <description>QDC0_CMP_FLAG0 input is selected</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val16</name>
                  <description>QDC0_CMP_FLAG1 input is selected</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>QDC0_CMP_FLAG2 input is selected</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>QDC0_CMP_FLAG3 input is selected</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>QDC0_POS_MATCH0 input is selected</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>TRIG_IN0 input is selected</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>TRIG_IN1 input is selected</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>TRIG_IN2 input is selected</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>TRIG_IN3 input is selected</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>TRIG_IN4 input is selected</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>TRIG_IN5 input is selected</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>TRIG_IN6 input is selected</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>TRIG_IN7 input is selected</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>TRIG_IN8 input is selected</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>TRIG_IN9 input is selected</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>TRIG_IN10 input is selected</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val31</name>
                  <description>TRIG_IN11 input is selected</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val32</name>
                  <description>GPIO0 Pin Event Trig 0 input is selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>GPIO1 Pin Event Trig 0 input is selected</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>GPIO2 Pin Event Trig 0 input is selected</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>GPIO3 Pin Event Trig 0 input is selected</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val36</name>
                  <description>GPIO4 Pin Event Trig 0 input is selected</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>AOI1_OUT0 input is selected</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val38</name>
                  <description>AOI1_OUT1 input is selected</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val39</name>
                  <description>AOI1_OUT2 input is selected</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val40</name>
                  <description>AOI1_OUT3 input is selected</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val45</name>
                  <description>CTimer3_MAT2 input is selected</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val46</name>
                  <description>CTimer3_MAT3 input is selected</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val47</name>
                  <description>CTimer4_MAT2 input is selected</description>
                  <value>0x2F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val48</name>
                  <description>CTimer4_MAT3 input is selected</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val49</name>
                  <description>QDC1_CMP_FLAG0 input is selected</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val50</name>
                  <description>QDC1_CMP_FLAG1 input is selected</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val51</name>
                  <description>QDC1_CMP_FLAG2 input is selected</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val52</name>
                  <description>QDC1_CMP_FLAG3 input is selected</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val53</name>
                  <description>QDC1_POS_MATCH0 input is selected</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val54</name>
                  <description>PWM1_SM0_MUX_TRIG0 input is selected</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val55</name>
                  <description>PWM1_SM0_MUX_TRIG1 input is selected</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val56</name>
                  <description>PWM1_SM1_MUX_TRIG0 input is selected</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val57</name>
                  <description>PWM1_SM1_MUX_TRIG1 input is selected</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val58</name>
                  <description>PWM1_SM2_MUX_TRIG0 input is selected</description>
                  <value>0x3A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val59</name>
                  <description>PWM1_SM2_MUX_TRIG1 input is selected</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val60</name>
                  <description>PWM1_SM3_MUX_TRIG0 input is selected</description>
                  <value>0x3C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val61</name>
                  <description>PWM1_SM3_MUX_TRIG1 input is selected</description>
                  <value>0x3D</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
