nxp-mcuxpresso/mcux-soc-svd/MCXA356/MCXA356.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>UTICK0</name>
      <description>Micro-Tick Timer</description>
      <groupName>UTICK</groupName>
      <baseAddress>0x4000B000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>UTICK0</name>
        <value>59</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DELAYVAL</name>
              <description>Tick Interval</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REPEAT</name>
              <description>Repeat Delay</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DELAYONCE</name>
                  <description>One-time delay</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAYREPEATS</name>
                  <description>Delay repeats continuously</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>Status</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>INTR</name>
              <description>Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOPENDINGINTERRUPT</name>
                  <description>Not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PENDINGINTERRUPT</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTIVE</name>
              <description>Timer Active Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMERISNOTACTIVE</name>
                  <description>Inactive (stopped)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMERISACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>Capture Configuration</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xF0F</resetMask>
          <fields>
            <field>
              <name>CAPEN0</name>
              <description>Enable Capture 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPEN0ISDISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPEN0ISENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPEN1</name>
              <description>Enable Capture 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPEN1ISDISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPEN1ISENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPEN2</name>
              <description>Enable Capture 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPEN2ISDISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPEN2ISENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPEN3</name>
              <description>Enable Capture 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPEN3ISDISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPEN3ISENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPPOL0</name>
              <description>Capture Polarity 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPPOL0POSEDGECAPTURE</name>
                  <description>Positive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPPOL0NEGEDGECAPTURE</name>
                  <description>Negative</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPPOL1</name>
              <description>Capture-Polarity 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPPOL1POSEDGECAPTURE</name>
                  <description>Positive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPPOL1NEGEDGECAPTURE</name>
                  <description>Negative</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPPOL2</name>
              <description>Capture Polarity 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPPOL2POSEDGECAPTURE</name>
                  <description>Positive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPPOL2NEGEDGECAPTURE</name>
                  <description>Negative</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPPOL3</name>
              <description>Capture Polarity 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPPOL3POSEDGECAPTURE</name>
                  <description>Positive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPPOL3NEGEDGECAPTURE</name>
                  <description>Negative</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CAPCLR</name>
          <description>Capture Clear</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CAPCLR0</name>
              <description>Clear Capture 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPCLR0NOTHING</name>
                  <description>Does nothing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPCLR0CLEARED</name>
                  <description>Clears the CAP0 register value</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPCLR1</name>
              <description>Clear Capture 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPCLR1NOTHING</name>
                  <description>Does nothing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPCLR1CLEARED</name>
                  <description>Clears the CAP1 register value</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPCLR2</name>
              <description>Clear Capture 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPCLR2NOTHING</name>
                  <description>Does nothing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPCLR2CLEARED</name>
                  <description>Clears the CAP2 register value</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPCLR3</name>
              <description>Clear Capture 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPCLR3NOTHING</name>
                  <description>Does nothing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPCLR3CLEARED</name>
                  <description>Clears the CAP3 register value</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CAP[%s]</name>
          <description>Capture</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAP_VALUE</name>
              <description>Captured Value for the Related Capture Event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Captured Value Valid Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTVALID</name>
                  <description>Valid value not captured</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Valid value captured</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
