nxp-mcuxpresso/mcux-soc-svd/MCXA356/MCXA356.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>OPAMP0</name>
      <description>OPAMP</description>
      <groupName>OPAMP</groupName>
      <headerStructName>OPAMP</headerStructName>
      <baseAddress>0x400B7000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VERID</name>
          <description>Version ID</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Specification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>Parameter</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PARAM</name>
              <description>Parameters</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPAMP_CTRL</name>
          <description>OPAMP Control</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPA_EN</name>
              <description>OPAMP Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPA_CC_SEL</name>
              <description>Compensation capcitor config selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBD1</name>
                  <description>Fit 2X gains</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBD2</name>
                  <description>Fit 4X gains</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBD3</name>
                  <description>Fit 8X gains</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBD4</name>
                  <description>Fit 16X gains</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPA_BC_SEL</name>
              <description>Bias current config selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBD1</name>
                  <description>Default value. Keep power consumption constant</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBD2</name>
                  <description>Reduce power consumption to 1/4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBD3</name>
                  <description>Reduce power consumption to 1/2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBD4</name>
                  <description>Increase power consumption to 3/2</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="OPAMP0">
      <name>OPAMP1</name>
      <description>OPAMP</description>
      <groupName>OPAMP</groupName>
      <baseAddress>0x400B8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="OPAMP0">
      <name>OPAMP2</name>
      <description>OPAMP</description>
      <groupName>OPAMP</groupName>
      <baseAddress>0x400B9000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
